using UnityEngine;

// §ª§ß§ä§Ö§â§æ§Ö§Û§ã §ã§à§ã§ä§à§ñ§ß§Ú§ñ
public interface IState
{
    // §£§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §á§â§Ú §Ó§ç§à§Õ§Ö §Ó §ã§à§ã§ä§à§ñ§ß§Ú§Ö
    public void Enter();

    // §£§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §á§â§Ú §Ó§í§ç§à§Õ§Ö §Ú§Ù §ã§à§ã§ä§à§ñ§ß§Ú§ñ
    public void Exit();

    // §£§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §Õ§Ý§ñ §à§Ò§â§Ñ§Ò§à§ä§Ü§Ú §Ó§Ó§à§Õ§Ñ
    public void HandleInput();

    // §£§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §Õ§Ý§ñ §à§Ò§ß§à§Ó§Ý§Ö§ß§Ú§ñ §Ý§à§Ô§Ú§Ü§Ú §ã§à§ã§ä§à§ñ§ß§Ú§ñ
    public void Update();

    // §£§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §Õ§Ý§ñ §à§Ò§ß§à§Ó§Ý§Ö§ß§Ú§ñ §æ§Ú§Ù§Ú§Ü§Ú §ã§à§ã§ä§à§ñ§ß§Ú§ñ
    public void PhysicsUpdate();
}
